[
    {
        "formatted_text": "<p>To me, couture is like democracy. Like a constitution, a couture dress is a suggestion of an ideal for the masses, one that contravenes a tyrannically mundane reality. When I write for my fashion philosophy blog (somethingvain.tumblr.com), I can forget about Bangkok&rsquo;s oppressive concrete landscape. Couture&rsquo;s unearthly momentum inspires my metaphysical passion, a search for revelations on the human condition that effervesce under the surface of a couture collection. I am a philosopher, a couture activist, an idealist. Perhaps for my followers couture holds this magnetism: amidst life&rsquo;s defects, couture is a preserved perfection embodying our collective dreams.</p>\n\n<p>&nbsp;</p>\n\n<p>But On July 2nd 2012, this dream came under attack. On July 2nd, 2012, Raf Simons presented Dior&rsquo;s &ldquo;New Look&rdquo; collection, a collection of minimalist couture. Hands poised over the keyboard to write my metaphysical review, I was shocked when the first dress come out &ndash; an unadorned affair, looking like ready-to-wear on a couture runway. A preserved perfection shattered. The shock reverberated my world of die-hard couture lovers. Minimalist couture? What an oxymoron! The 24,000 voices of my followers began to flood my dashboard, my inbox, crying out:&nbsp;<em>minimalist couture</em>? No! Did the fluid, simple lines of the &ldquo;New Look&rdquo; evoke our bourgeois Couture fantasy? Definitely not.</p>\n\n<p>&nbsp;</p>\n\n<p>The majority cast their vote for a scathing review on the &ldquo;New Look&rdquo;. There was only one thing stopping me from writing it: the fact that I actually liked the collection. Minimalist couture? Yes. There was an undeniable practicality that didn&rsquo;t fit the bourgeois dream Couture usually embodied, but its elegance whispered at a new dream &ndash; the dream of empowering the proletariat we already were, instead of aspiring towards the bourgeoisie we might never be. The dissonance struck me because I knew my followers would hate my honest opinion. And doubtless, in the democratic culture of opinion, the majority is always right.</p>\n\n<p>&nbsp;</p>\n\n<p>Or is it? Majority rule is key in my homeland, Thailand, a country that barely conceals democracy&rsquo;s failures. I knew this all too well &ndash; during my internship with the Democrat party of Thailand, I&rsquo;d made an impassioned speech at a rally on the Amnesty bill on the tyranny of the majority, speaking against the government&rsquo;s swift vote that pre-empted opposition. I thought of the question I&rsquo;d asked crowd, &ldquo;When asked what is right, does the minority not have a say?&rdquo; I had to ask this of myself. I was one voice against 24,000. But I did have a say. As a couture activist, I believed that minimalist couture is valid. And I believe that it is not undemocratic to say that the majority is not always right.</p>\n\n<p>&nbsp;</p>\n\n<p>I wrote my honest positive review, and lost over 500 followers. But I would do it again. In risking the loss of influence over my followers, I was saved from losing the&nbsp;<em>kratos</em>&nbsp;over myself. Yes, I still believe that Couture is like democracy. And like democracy, it&rsquo;s simply a suggestion of an ideal &ndash; there is no strict definition that limits what form it must take, as long as it stays true to principles of &ldquo;right&rdquo;. I may not become a philosopher, or a politician. But my life&rsquo;s work is in discovering principles of &ldquo;right&rdquo; that I can stay true to, in staying true to myself.</p>\n",
        "due_date": "2014-06-17",
        "essay": 1
    },
    {
        "formatted_text": "<p>To me, couture is pure escapism. Like a theoretical utopia, the grandiose spectacle of a couture dress is a suggestion of an ideal for the masses, one that defies a tyrannically mundane reality. When I write for my fashion philosophy blog (somethingvain.tumblr.com), I can forget about Bangkok&rsquo;s oppressive concrete landscape. Couture&rsquo;s extraordinary momentum inspires my metaphysical passion, a search for revelations on the human condition that effervesce beneath the hand-cut tulle paillettes and cascading folds of glittering fabric. I am a philosopher and an idealist. Perhaps for my followers couture holds this same magnetism: amidst life&rsquo;s defects, couture is a preserved perfection embodying our collective dreams.</p>\n\n<p>&nbsp;</p>\n\n<p>But On July 2nd 2012, this dream came under attack. Raf Simons presented Dior&rsquo;s &ldquo;New Look&rdquo; collection, a collection of minimalist couture. Hands poised over the keyboard to write my metaphysical review, I was shocked when the first dress came out - an unadorned affair, looking like ready-to-wear on a couture runway. A collective dream shattered. The shock reverberated my world of die-hard couture lovers. The 24,000 voices of my followers began to flood my dashboard, my inbox, crying out: <em>minimalist couture</em>? No! What an oxymoron. Did the fluid, simple silhouette of the &ldquo;New Look&rdquo; dresses evoke our awe-inspiring Couture fantasy? Definitely not.</p>\n\n<p>&nbsp;</p>\n\n<p>My hands were frozen over the keyboard. The majority cast their vote for my scathing review on the &ldquo;New Look&rdquo;. There was only one thing stopping me from writing it: I realized&hellip;I actually liked the collection. Minimalist couture? Yes. There was an undeniable practicality that didn&rsquo;t fit the elaborate dream Couture usually embodied, but its elegance whispered to me a new dream &ndash; the dream of empowering the proletariat we already were, instead of aspiring towards the aristocrats we might never be. The dissonance struck me because I knew my followers would hate my honest opinion. Doubtless, in the democratic culture of opinion, the majority is always right. My dissonance caught me as if in a web of lace embroidery; I wanted to write a positive review that I knew would be overwhelmed by cascades of negative reception.</p>\n\n<p>&nbsp;</p>\n\n<p>But did my keyboard strokes have to follow the defined lines of what the majority deemed as &lsquo;right&rsquo;? On somethingvain, I was the voice leading the majority to the point where I had become encumbered by the responsibility. Yet, as I began to cave in, I realized I&rsquo;d experienced responsibility of the opposite kind in an equally important context. As an intern for the Democrat party, I had been the minority speaking out against the tyranny of the majority. Standing before that crowd of the silenced but not subdued, the urgency of my responsibility as the voice of the minority was equally demanding. Now, somethingvain was the voice against thousands. But would she be subdued? Political Jasmine had the power to speak up, and somethingvain had the strength to do the same. As a couture activist, I believed that minimalist couture is valid. And I believe that it is not undemocratic to say that the majority is not always right.</p>\n\n<p>&nbsp;</p>\n\n<p>I wrote my honest positive review, and lost hundreds of followers. But I would do it again. In risking the loss of influence over my <em>demos</em>, my followers, I was saved from losing the <em>kratos</em> over myself. Perhaps as a writer I will sometimes be that lone voice. But in true democratic form, there is no absolute rule. As a philosopher and an idealist, I may find myself siding with the majority. Managing my dissonance in a world that stands in contrast to the preserved perfection of couture, I look forward to seeing how my never-ending internal debates will play out.</p>\n",
        "due_date": "2014-06-20",
        "essay": 1
    },
    {
        "formatted_text": "<p>To me, haute couture is utopia. The spectacle of a couture dress suggests an ideal for the proletariat, one that defies a tyrannically mundane reality. I can forget about Bangkok&rsquo;s oppressive concrete landscape when I write for my fashion philosophy blog SomethingVain (somethingvain.tumblr.com), because with couture, I become a philosopher and an idealist. Its momentum inspires my metaphysical passion, my search for revelations on the human condition that effervesce beneath the cascading folds of fabric. As it is for me, my followers find in couture an embodiment of our collective dreams.</p>\n\n<p>&nbsp;</p>\n\n<p>But in July 2012, this dream was attacked. Raf Simons presented Dior&rsquo;s &ldquo;New Look&rdquo;, a collection of minimalist couture. Hands poised over the keyboard to write my review, I was shocked when the first dress came out - an unadorned affair, on a runway known for ostentation! The dream of couture is an extravagant one, whilst minimalism is simplicity at its barest. A collective dream shattered. With shock, the 24,000 voices of my followers began to flood my dashboard, my inbox, crying out: <em>minimalist couture</em>? What an oxymoron! Did the simple silhouette of the &ldquo;New Look&rdquo; evoke our Couture fantasy? No!</p>\n\n<p>&nbsp;</p>\n\n<p>My hands froze over the keyboard. The majority cast their vote for my scathing review on the &ldquo;New Look&rdquo;. Only one thing stopped me from writing it&hellip;I actually liked the collection. Minimalist couture? Personally, yes. There was a practicality that contravened the elaborate dream Couture embodied, but I saw in its simplicity a new dream &ndash; the dream of empowering the proletariat we already were, instead of aspiring towards the ideal of aristocrats we might never be. The dissonance struck me because I knew my followers would hate my honest opinion, and in the democracy of the Internet, the majority rules. I wanted to write a positive review that would be overwhelmed by cascades of negative reception.</p>\n\n<p>&nbsp;</p>\n\n<p>But was my writing condemned to majority rule? As SomethingVain, perhaps I am the voice responsible for leading the majority. But I experience an opposing responsibility in another context. Political Jasmine stands in the minority. As an intern for the Thai Democrat party, I&rsquo;d felt the minority&rsquo;s impotence during debates over a controversial Amnesty bill that the Democrats opposed, but parliamentary majority forced through. When the government called the Democrats &lsquo;undemocratic&rsquo; for fighting the majority, I was asked to speak at an Amnesty bill rally.&nbsp; Standing before a crowd of the powerless, the urgency of my responsibility as a voice of the minority was demanding. Now, SomethingVain was the voice against thousands. But would she be subdued? Political Jasmine had the power to speak up, and SomethingVain could do the same. I believed that minimalist couture was valid. And I still believe that saying the majority isn&rsquo;t always right is not undemocratic.</p>\n\n<p>&nbsp;</p>\n\n<p>I wrote my honest positive review, and lost hundreds of followers. But I would do it again. In risking the loss of influence over my <em>demos</em>, my followers, I was saved from losing the <em>kratos</em> over myself. Perhaps as a writer I will sometimes be that lone voice. But in true democratic form, there is no absolute rule. As a philosopher and an idealist, I may find myself siding with the majority. Writing in a world that stands in contrast to the preserved idealism of couture, I look forward to seeing how my never-ending internal debates will play out.</p>\n",
        "due_date": "2014-07-05",
        "essay": 1
    },
    {
        "formatted_text": "<p>To me, haute couture is utopia. French for &ldquo;high sewing&rdquo;, the prestigious label describes handmade clothing created in Parisian ateliers. But the spectacle of a couture dress suggests an ideal for the proletariat that defies a tyrannically mundane reality. I can forget about Bangkok&rsquo;s concrete landscape when I write for my fashion philosophy blog SomethingVain (somethingvain.tumblr.com), because with couture, I become a philosopher and an idealist. Its momentum inspires my metaphysical passion, my search for revelations on the human condition that effervesce beneath the cascading fabric. Like me, my followers find in couture an embodiment of our collective dreams.</p>\n\n<p>&nbsp;</p>\n\n<p>But in July 2012, this dream was attacked. Raf Simons presented Dior&rsquo;s &ldquo;New Look&rdquo;, a collection of minimalist couture. Hands poised over the keyboard to write my review, I was shocked when the first dress came out - an unadorned affair, on a runway known for ostentation! The dream of couture is an extravagant one, whilst minimalism is simplicity at its barest. A collective dream shattered. With shock, the 24,000 voices of my followers began to flood my dashboard, my inbox, crying out: <em>minimalist couture</em>? What an oxymoron! Did the simple silhouette of the &ldquo;New Look&rdquo; evoke our couture fantasy? No!</p>\n\n<p>&nbsp;</p>\n\n<p>My hands froze over the keyboard. The majority cast their vote for my scathing review on the &ldquo;New Look&rdquo;. Only one thing stopped me from writing it&hellip;I actually liked the collection. Minimalist couture? Personally, yes. There was a practicality that contravened the elaborate dream couture embodied, but I saw in its simplicity a new dream &ndash; the dream of empowering the proletariat we already were, instead of idealizing the aristocracy we might never become. The dissonance struck me because I knew my followers would hate my honest opinion, and in the democracy of the Internet, the majority rules. I wanted to write a positive review that would be overwhelmed by cascades of negative reception.</p>\n\n<p>&nbsp;</p>\n\n<p>But was my writing condemned to majority rule? As SomethingVain, perhaps I am the voice responsible for leading the majority. But I experience an opposing responsibility in another context. Political Jasmine stands in the minority. As an intern for the Thai Democrat party, I&rsquo;d felt the minority&rsquo;s impotence during debates over a controversial Amnesty bill that the Democrats opposed, but parliamentary majority forced through. When the government called the Democrats &lsquo;undemocratic&rsquo; for fighting the majority, I was asked to speak at an Amnesty bill rally. Standing before a crowd of the powerless, the urgency of my responsibility as a voice of the minority was demanding. Now, SomethingVain was the voice against thousands. But would she be subdued? Political Jasmine had the power to speak up, and SomethingVain could do the same. I believed that minimalist couture was valid. And I still believe that opposing the majority is not undemocratic.</p>\n\n<p>&nbsp;</p>\n\n<p>I wrote my honest positive review, and lost hundreds of followers. But I would do it again. In risking the loss of influence over my <em>demos</em>, my followers, I was saved from losing the <em>kratos, </em>power, over myself. Perhaps as a writer I will sometimes be that lone voice. But in true democratic form, there is no absolute rule. As a philosopher and an idealist, I may find myself siding with the majority. Writing in a world that contrasts with the preserved idealism of couture, I look forward to seeing how my never-ending debates will play out.</p>\n",
        "due_date": "2014-07-15",
        "essay": 1
    }
]
